Terraform Plan:

```
oci_identity_compartment.k8s: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa4bbfmz332ypqxr6icuitp54jj7czdp4qliuo575ytuqakppgtmra]
module.virtual_machine.data.oci_identity_availability_domains.ads: Reading...
module.virtual_network.oci_core_vcn.vcn["vcn1"]: Refreshing state... [id=ocid1.vcn.oc1.eu-frankfurt-1.amaaaaaaic6ifviaeoaecu6uwycqmey7fx557mpjsj2cq2m35l5czm66to6a]
module.virtual_machine.data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-2220574233]
module.virtual_network.oci_core_internet_gateway.igw["vcn1"]: Refreshing state... [id=ocid1.internetgateway.oc1.eu-frankfurt-1.aaaaaaaatkiuijvp3iqbqnkdtznubouu2tg2verx24tgajrkoh5kh4znr7sa]
module.virtual_network.oci_core_network_security_group.nsg["vcn1"]: Refreshing state... [id=ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa]
module.virtual_network.oci_core_route_table.rt["vcn1"]: Refreshing state... [id=ocid1.routetable.oc1.eu-frankfurt-1.aaaaaaaayo35y4z5ptradj66364ykxoqytm6mfnqfahiwboyevwscpq4zf3a]
module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule1"]: Refreshing state... [id=F9258D]
module.virtual_network.oci_core_subnet.subnet["subnet1"]: Refreshing state... [id=ocid1.subnet.oc1.eu-frankfurt-1.aaaaaaaaxk5c2nrlrmqdyvj7rprsp57wmfwdvqcloexfo4omsi3soafnpfrq]
module.virtual_machine.oci_core_instance.vm["worker2"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvic4pb5ps5nmwormfclzw73jukt4jo46xtmjwpytmxll5qq]
module.virtual_machine.oci_core_instance.vm["worker1"]: Refreshing state... [id=ocid1.instance.oc1.eu-frankfurt-1.antheljtic6ifvicmwwhl2b55o4u2na6l2d6q2k7qib6k6buod6pmw6ojqsq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule1"] will be updated in-place
  ~ resource "oci_core_network_security_group_security_rule" "nsg_rule" {
      ~ description               = "test rule" -> "ssh"
        id                        = "F9258D"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.virtual_network.oci_core_network_security_group_security_rule.nsg_rule["rule2"] will be created
  + resource "oci_core_network_security_group_security_rule" "nsg_rule" {
      + description               = "influxdb"
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = "ocid1.networksecuritygroup.oc1.eu-frankfurt-1.aaaaaaaa77qzf3kjaksjekmwpf7ljfaohaclwaklrzztsea4umy5usxnl4xa"
      + protocol                  = "6"
      + source                    = "185.230.172.74/32"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = false
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 8086
              + min = 8086
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

Plan saved to GH artifacts.